const head ='——————————————————————————————————  ℛ𝓞𝓢ℳ𝓐ℛ𝓘𝓝𝓤𝓢  ——————————————————————————————————\n' +
            '######    #####    #####   ##   ##     ##    ######    ######  ##   ##   ##  ##   #####\n' +
            ' ##  ##  ##   ##  ##   ##  ### ###    ####    ##  ##     ##    ###  ##   ##  ##  ##   ##\n' +
            ' ##  ##  ##   ##  ##       #######   ##  ##   ##  ##     ##    #### ##   ##  ##  ##\n' +
            ' #####   ##   ##   #####   ## # ##   ######   #####      ##    ## ####   ##  ##   #####\n' +
            ' ####    ##   ##       ##  ##   ##   ##  ##   ####       ##    ##  ###   ##  ##       ##\n' +
            ' ## ##   ##   ##  ##   ##  ##   ##   ##  ##   ## ##      ##    ##   ##   ##  ##  ##   ##\n' +
            '###  ##   #####    #####   ##   ##   ##  ##  ###  ##   ######  ##   ##    ####    #####\n' +
            '—————————————————————————————————— 半自动 Screeps AI ——————————————————————————————————\n';


export default [
    {
        alias: 'help',
        exec: function () {
            return head +
                '###  指令列表  ###\n' +
                'help: 查看帮助\n' +
                'helpRoom: 查看房间相关指令\n'
        }
    },
    {
        alias: 'helpRoom',
        exec: function () {
            return '###  房间指令列表  ###\n' +
                'room.add(roomName, mode, layout, x, y): 添加房间到控制列表，列表中的房间才会自动运行。\n' +
                ' - roomName: 房间名 mode: 运行模式 layout: 布局 x,y: 布局中心\n' +
                ' - 后面的参数可以为空，空则使用默认值。\n' +
                ' - helpLayout: 查看布局帮助\n' +
                'room.remove(roomName): 从控制列表删除房间\n' +
                'room.list(): 查看控制列表\n'
        }
    }
]
